SunCity/src/DataProcessors/ЗаполнениеДиапазонаСерийныхНомеров/ЗаполнениеДиапазонаСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеДиапазонаСерийныхНомеров</name>
  <attributes>
    <name>ВыборВДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьМагнитныеКоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьШтрихкоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйШтрихкод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйШтрихкодEAN13</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйШтрихкодEAN8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШтрихкодаРТ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСимволов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

SunCity/src/ChartsOfCharacteristicTypes/ТипыШтрихкодов/ТипыШтрихкодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ТипыШтрихкодов</name>
  <type>
    <types>String</types>
    <stringQualifiers>
      <length>200</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>CODE128</name>
      <description>CODE128</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>CODE39</name>
      <description>CODE39</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>EAN128</name>
      <description>EAN128</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>EAN13</name>
      <description>EAN13</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>EAN8</name>
      <description>EAN8</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ITF14</name>
      <description>ITF14</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

SunCity/src/DataProcessors/ЗаполнениеДиапазонаСерийныхНомеров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если НЕ ЕстьМагнитныеКоды ИЛИ ВыборВДокумент Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоСимволов");
		
	КонецЕсли;
	
	Если ЕстьШтрихкоды Тогда
		
		Если ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
		ИначеЕсли ТипШтрихкодаРТ = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
		Иначе
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
			МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкод");
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN8");
		МассивНепроверяемыхРеквизитов.Добавить("ПервыйШтрихкодEAN13");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
